{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hello!",
                "Good day!",
                "Hi there!",
                "Hey!",
                "Hi, chatbot!",
                "Greetings!",
                "Hi, how can I help?",
                "Hey, what's up?",
                "Howdy!",
                "Hi, what's on your mind?",
                "Yo!",
                "Sup, chatbot?",
                "Hello",
                "Hi",
                "Hey",
                "Sup",
                "Howdy",
                "Greetings",
                "Hi there",
                "Hello there",
                "Hey chatbot",
                "What's up",
                "Yo bot",
                "Sup bot",
                "Hey there",
                "Hello friend",
                "Hey buddy",
                "Hiya bot",
                "Hello world",
                "Hiya there",
                "Hey, what's",
                "Hi, how's",
                "Hey, howdy",
                "Hello, Greetings",
                "Hi, good",
                "Hey, ready"
            ],
            "responses": ["Hello! How can I assist you with information about NIT-Trichy?",
                "Hi there! How can I help you learn more about NIT-Trichy?",
                "Hey! Welcome to NIT-Trichy's chatbot. How can I provide you with information?",
                "Hi, chatbot! How can I make your experience with NIT-Trichy more informative?",
                "Greetings! How can I assist you in your exploration of NIT-Trichy?",
                "Howdy! Need information about NIT-Trichy? I'm here to help!",
                "Hello! Welcome to NIT-Trichy's chatbot. What can I assist you with today?",
                "Hey, what's up? How can I enhance your understanding of NIT-Trichy?",
                "Hey there, how can I make your interaction with NIT-Trichy more productive?",
                "Hi, nice to meet you! How can I provide you with insights about NIT-Trichy?",
                "Hi, what's going on? How can I assist you in your journey of learning about NIT-Trichy?",
                "Hello, how's it going? Need information about NIT-Trichy? I'm here to help!",
                "Hi, what brings you here? Let me know how I can assist you with NIT-Trichy-related information.",
                "Hey, how's your day so far? Need any information about NIT-Trichy?",
                "Hi, how's everything? How can I make your experience with NIT-Trichy more informative?",
                "Hey, what can I do for you? Let me know how I can assist you with NIT-Trichy inquiries.",
                "Hello, how can I be of service? Need information about NIT-Trichy? I'm here to help!",
                "Hi, what's on your mind? Feel free to ask any questions you have about NIT-Trichy."]
        },
        {
            "tag": "Festember",
            "patterns": [
                "Tell me about Festember.",
                "What is Festember all about?",
                "Give me details about the Festember event.",
                "When does Festember usually take place?",
                "Can you share information about NIT Trichy's Festember?",
                "Tell me what happens during Festember.",
                "What kind of activities are there in Festember?",
                "When and where does Festember usually happen?",
                "Explain the concept of Festember at NIT Trichy.",
                "What are the highlights of the Festember festival?",
                "Tell me about the cultural fest at NIT Trichy.",
                "Tell me about Festember.",
                "Festember details",
                "Festember event",
                "Festember time",
                "NIT Trichy Festember",
                "What happens during Festember?",
                "Festember activities",
                "Festember schedule",
                "Festember concept",
                "Festember highlights",
                "Cultural fest",
                "Can you tell me the schedule of events for Festember?",
                "What's the lineup for Festember this year?",
                "Give me the list of events happening during Festember.",
                "When can I find the Festember event schedule?",
                "Tell me about the different activities in this year's Festember.",
                "What are the main events scheduled for Festember?"

            ],
            "responses": ["Festember is NIT Trichy's annual cultural festival, celebrated in October. It's a vibrant event with cultural performances, workshops, competitions, and entertainment. Attendees from across the country enjoy music, dance, theater, art exhibitions, and more. The festival features diverse activities, including live music, dance contests, fashion shows, art displays, theater acts, workshops, and discussions. For detailed event schedules, visit the official Festember website or refer to the festival brochure."]
        },
        {
            "tag": "Pragyan",
            "patterns": [
                "Tell me about Pragyan.",
                "What is Pragyan?",
                "Give me details about the Pragyan event.",
                "When does Pragyan usually take place?",
                "Can you share information about NIT Trichy's Pragyan?",
                "Tell me what happens during Pragyan.",
                "What kind of activities are there in Pragyan?",
                "When and where does Pragyan usually happen?",
                "Explain the concept of Pragyan at NIT Trichy.",
                "What are the highlights of the Pragyan festival?",
                "Tell me about the technical fest at NIT Trichy.",
                "Pragyan details",
                "Pragyan event",
                "Pragyan time",
                "NIT Trichy Pragyan",
                "What happens during Pragyan?",
                "Pragyan activities",
                "Pragyan schedule",
                "Pragyan concept",
                "Pragyan highlights",
                "Technical fest",
                "Can you tell me the schedule of events for Pragyan?",
                "What's the lineup for Pragyan this year?",
                "Give me the list of events happening during Pragyan.",
                "When can I find the Pragyan event schedule?",
                "Tell me about the different activities in this year's Pragyan.",
                "What are the main events scheduled for Pragyan?"
            ],
            "responses": ["Pragyan is NIT Trichy's annual techno-managerial festival, typically conducted during the even semester. It showcases a diverse range of technical, managerial, and cultural events, attracting participants from all over the country. Pragyan aims to provide a platform for students to showcase their talents, learn from experts, and engage in various enriching activities. For the latest updates and detailed information about Pragyan, you can visit the official Pragyan website or page."]
        },
        {
            "tag": "NITTFEST",
            "patterns": [
                "Tell me about NITTFEST.",
                "What is NITTFEST all about?",
                "Give me details about the NITTFEST event.",
                "When does NITTFEST usually take place?",
                "Can you share information about NIT Trichy's NITTFEST?",
                "Tell me what happens during NITTFEST.",
                "What kind of activities are there in NITTFEST?",
                "When and where does NITTFEST usually happen?",
                "Explain the concept of NITTFEST at NIT Trichy.",
                "What are the highlights of the NITTFEST festival?",
                "Tell me about the cultural fest at NIT Trichy.",
                "Department fest",
                "Inter-dept fest",
                "NITTFEST?",
                "NITTFEST details",
                "NITTFEST event",
                "NITTFEST time",
                "NIT Trichy NITTFEST",
                "What happens during NITTFEST?",
                "NITTFEST activities",
                "NITTFEST schedule",
                "NITTFEST concept",
                "NITTFEST highlights"
            ],
            "responses": ["NITTFEST is NIT Trichy's interdepartmental cultural festival that takes place during the even semester. It serves as a dynamic platform for students from various departments to showcase their artistic talents and engage in a wide array of cultural activities. For more detailed information, you can refer to the official NITTFEST website."]
        },
        {
            "tag": "Sportsfete",
            "patterns": [
                "Tell me about the upcoming sportsfete at NIT Trichy.",
                "What can you tell me about NIT Trichy's sports festival (sportsfete)?",
                "When is the sportsfete happening this year at NIT Trichy?",
                "I want to know more about the sportsfete at NIT Trichy.",
                "Are there any exciting sports events planned for the upcoming sportsfete?",
                "Give me an overview of the sportsfete at NIT Trichy.",
                "How can I participate in the sportsfete?",
                "Where can I find information about the schedule of the sportsfete?",
                "What sports are included in the sportsfete at NIT Trichy?",
                "Can you share details about the registration process for the sportsfete?",
                "Tell me about the highlights of the sportsfete.",
                "Is there an entrance fee for the sportsfete at NIT Trichy?",
                "Which teams typically participate in the sportsfete?",
                "What are the prizes and awards for the sportsfete?",
                "How can I volunteer to help during the sportsfete?",
                "Are there any special guest appearances expected at the sportsfete?",
                "Can you provide information about the facilities available during the sportsfete?",
                "Tell me about the theme or theme nights of the sportsfete.",
                "Are there any cultural events alongside the sportsfete?",
                "What's the official website or social media page for updates about the sportsfete?",
                "How can I get involved as a sponsor for the sportsfete?",
                "I'm an out-of-town participant. Are there accommodation options for the event?",
                "Can you share details about the opening and closing ceremonies of the sportsfete?",
                "Is there a dress code for attending the sportsfete?",
                "Tell me about the history of the sportsfete at NIT Trichy.",
                "What's the contact information for inquiries related to the sportsfete?",
                "Can you provide information about the safety measures in place for the event?",
                "Tell me about the past editions of the sportsfete at NIT Trichy.",
                "Sports?",
                "About sportsfete?",
                "sportsfete?",
                "Sportsfete details",
                "Sportsfete event",
                "Sportsfete time",
                "NIT Trichy sportsfete",
                "What happens during sportsfete?",
                "Sportsfete activities",
                "Sportsfete schedule",
                "Sportsfete concept",
                "Sportsfete highlights"
            ],
            "responses": ["Sportsfete is NIT-Trichy annual inter-departmental sports fest. Departments' sports enthusiasts compete in various events during the odd semesters. For more details, including the schedule, visit the sportsfete website."]
        },
        {
            "tag": "Aaveg",
            "patterns": [
                "Tell me about the upcoming AAVEG at NIT Trichy.",
                "What can you tell me about NIT Trichy's inter-hostel fest (AAVEG)?",
                "When is AAVEG happening this year at NIT Trichy?",
                "I want to know more about AAVEG at NIT Trichy.",
                "Are there any exciting events planned for the upcoming AAVEG?",
                "Give me an overview of AAVEG at NIT Trichy.",
                "How can I participate in AAVEG?",
                "Where can I find information about the schedule of AAVEG?",
                "What activities are included in AAVEG at NIT Trichy?",
                "Can you share details about the registration process for AAVEG?",
                "Tell me about the highlights of AAVEG.",
                "Is there an entry fee for AAVEG at NIT Trichy?",
                "Which hostels typically participate in AAVEG?",
                "What are the prizes and awards for AAVEG?",
                "How can I volunteer to help during AAVEG?",
                "Are there any special guest appearances expected at AAVEG?",
                "Can you provide information about the facilities available during AAVEG?",
                "Tell me about the theme or theme nights of AAVEG.",
                "Are there any cultural events alongside AAVEG?",
                "What's the official website or social media page for updates about AAVEG?",
                "How can I get involved as a sponsor for AAVEG?",
                "I'm an out-of-town participant. Are there accommodation options for the event?",
                "Can you share details about the opening and closing ceremonies of AAVEG?",
                "Is there a dress code for attending AAVEG?",
                "Tell me about the history of AAVEG at NIT Trichy.",
                "What's the contact information for inquiries related to AAVEG?",
                "Can you provide information about the safety measures in place for the event?",
                "Tell me about the past editions of AAVEG at NIT Trichy.",
                "Hostel fest?",
                "About AAVEG?",
                "AAVEG?",
                "AAVEG details",
                "AAVEG event",
                "AAVEG time",
                "NIT Trichy AAVEG",
                "What happens during AAVEG?",
                "AAVEG activities",
                "AAVEG schedule",
                "AAVEG concept",
                "AAVEG highlights"
            ],
            "responses": ["AAVEG is NIT-T's annual inter-hostel fest where different hostels compete in a variety of events. It's a vibrant celebration of talent and camaraderie among students during the academic year. For more information, including the schedule, visit the official AAVEG website."]
        },
        {
            "tag": "Computer Science Department - NIT Trichy",
        "patterns": [
                "Tell me about the Computer Science Department at NIT Trichy.",
                "What programs does the Computer Science Department at NIT Trichy offer?",
                "Who are the faculty members in the Computer Science Department at NIT Trichy?",
                "Is there an upcoming open house or information session for the Computer Science Department at NIT Trichy?",
                "I want to know more about research opportunities in the Computer Science Department at NIT Trichy.",
                "What is the admission process for Computer Science programs at NIT Trichy?",
                "Tell me about recent achievements or projects from the Computer Science Department at NIT Trichy.",
                "How can I apply for scholarships or financial aid in the Computer Science Department at NIT Trichy?",
                "Are there internship opportunities available through the Computer Science Department at NIT Trichy?",
                "Is there a Computer Science club or student organization at NIT Trichy?",
                "Tell me about the alumni network of the Computer Science Department at NIT Trichy.",
                "Are there any upcoming events or conferences organized by the Computer Science Department at NIT Trichy?",
                "Can you provide information about the facilities and labs in the Computer Science Department at NIT Trichy?",
                "Tell me about the research focus areas in the Computer Science Department at NIT Trichy.",
                "What is the Computer Science Department's social media page or official website for updates and announcements?",
                "How can I get involved as a volunteer or mentor in the Computer Science Department at NIT Trichy?",
                "Can you share contact information for inquiries related to the Computer Science Department at NIT Trichy?",
                "Tell me about the Computer Science Department's involvement in community outreach or education programs at NIT Trichy.",
                "What are the recent publications or research papers from the Computer Science Department at NIT Trichy?",
                "Do you have information about internships and job placement rates for Computer Science graduates at NIT Trichy?",
                "Tell me about the history and evolution of the Computer Science Department at NIT Trichy.",
                "Are there any special events or lectures organized by the Computer Science Department at NIT Trichy that I can attend?",
                "Can you provide information about the safety measures and protocols in place in the Computer Science Department at NIT Trichy?",
                "Tell me about the collaborations and partnerships of the Computer Science Department at NIT Trichy.",
                "What notable alumni have graduated from the Computer Science Department at NIT Trichy?",
                "How can I schedule a tour of the Computer Science Department at NIT Trichy?",
                "Do you have any information about student projects or innovations from the Computer Science Department at NIT Trichy?",
                "Tell me about the department's vision and mission at NIT Trichy.",
                "Cs?",
                "Computer science?",
                "cs dept",
                "computer dept",
                "computer science engineering"
            ],
    "responses": ["The Computer Science Department at NIT Trichy is a leading center for education and research in the field. We offer a range of programs, have a distinguished faculty, and are actively involved in groundbreaking research. For the latest updates and detailed information, please visit the official Computer Science Department page on the NIT Trichy website."]
        },
        {
        "tag": "ECE Department - NIT Trichy",
        "patterns": [
        "Tell me about the Electronics and Communication Engineering (ECE) Department at NIT Trichy.",
        "What programs does the ECE Department at NIT Trichy offer?",
        "Who are the faculty members in the Electronics and Communication Engineering (ECE) Department at NIT Trichy?",
        "Is there an upcoming open house or information session for the ECE Department at NIT Trichy?",
        "I want to know more about research opportunities in the Electronics and Communication Engineering (ECE) Department at NIT Trichy.",
        "What is the admission process for ECE programs at NIT Trichy?",
        "Tell me about recent achievements or projects from the Electronics and Communication Engineering (ECE) Department at NIT Trichy.",
        "How can I apply for scholarships or financial aid in the ECE Department at NIT Trichy?",
        "Are there internship opportunities available through the Electronics and Communication Engineering (ECE) Department at NIT Trichy?",
        "Is there an ECE club or student organization at NIT Trichy?",
        "Tell me about the alumni network of the Electronics and Communication Engineering (ECE) Department at NIT Trichy.",
        "Are there any upcoming events or conferences organized by the ECE Department at NIT Trichy?",
        "Can you provide information about the facilities and labs in the ECE Department at NIT Trichy?",
        "Tell me about the research focus areas in the Electronics and Communication Engineering (ECE) Department at NIT Trichy.",
        "What is the ECE Department's social media page or official website for updates and announcements?",
        "How can I get involved as a volunteer or mentor in the Electronics and Communication Engineering (ECE) Department at NIT Trichy?",
        "Can you share contact information for inquiries related to the ECE Department at NIT Trichy?",
        "Tell me about the ECE Department's involvement in community outreach or education programs at NIT Trichy.",
        "What are the recent publications or research papers from the Electronics and Communication Engineering (ECE) Department at NIT Trichy?",
        "Do you have information about internships and job placement rates for ECE graduates at NIT Trichy?",
        "Tell me about the history and evolution of the Electronics and Communication Engineering (ECE) Department at NIT Trichy.",
        "Are there any special events or lectures organized by the ECE Department at NIT Trichy that I can attend?",
        "Can you provide information about the safety measures and protocols in place in the Electronics and Communication Engineering (ECE) Department at NIT Trichy?",
        "Tell me about the collaborations and partnerships of the Electronics and Communication Engineering (ECE) Department at NIT Trichy.",
        "What notable alumni have graduated from the Electronics and Communication Engineering (ECE) Department at NIT Trichy?",
        "How can I schedule a tour of the Electronics and Communication Engineering (ECE) Department at NIT Trichy?",
        "Do you have any information about student projects or innovations from the ECE Department at NIT Trichy?",
        "Tell me about the department's vision and mission at NIT Trichy.",
        "ECE?",
        "Electronics and Communication Engineering?",
        "ECE dept",
        "Electronics dept",
        "ECE engineering"
         ],
    "responses": ["The Electronics and Communication Engineering (ECE) Department at NIT Trichy is a prominent center for education and research. We offer various programs, have a dedicated faculty, and actively engage in cutting-edge research. For the latest updates and detailed information, please visit the official ECE Department page on the NIT Trichy website."]
        },
        {
        "tag": "EEE Department - NIT Trichy",
        "patterns": [
        "Tell me about the Electrical and Electronics Engineering (EEE) Department at NIT Trichy.",
        "What programs does the EEE Department at NIT Trichy offer?",
        "Who are the faculty members in the Electrical and Electronics Engineering (EEE) Department at NIT Trichy?",
        "Is there an upcoming open house or information session for the EEE Department at NIT Trichy?",
        "I want to know more about research opportunities in the EEE Department at NIT Trichy.",
        "What is the admission process for EEE programs at NIT Trichy?",
        "Tell me about recent achievements or projects from the EEE Department at NIT Trichy.",
        "How can I apply for scholarships or financial aid in the EEE Department at NIT Trichy?",
        "Are there internship opportunities available through the EEE Department at NIT Trichy?",
        "Is there an EEE club or student organization at NIT Trichy?",
        "Tell me about the alumni network of the EEE Department at NIT Trichy.",
        "Are there any upcoming events or conferences organized by the EEE Department at NIT Trichy?",
        "Can you provide information about the facilities and labs in the EEE Department at NIT Trichy?",
        "Tell me about the research focus areas in the EEE Department at NIT Trichy.",
        "What is the EEE Department's social media page or official website for updates and announcements?",
        "How can I get involved as a volunteer or mentor in the EEE Department at NIT Trichy?",
        "Can you share contact information for inquiries related to the EEE Department at NIT Trichy?",
        "Tell me about the EEE Department's involvement in community outreach or education programs at NIT Trichy.",
        "What are the recent publications or research papers from the EEE Department at NIT Trichy?",
        "Do you have information about internships and job placement rates for EEE graduates at NIT Trichy?",
        "Tell me about the history and evolution of the EEE Department at NIT Trichy.",
        "Are there any special events or lectures organized by the EEE Department at NIT Trichy that I can attend?",
        "Can you provide information about the safety measures and protocols in place in the EEE Department at NIT Trichy?",
        "Tell me about the collaborations and partnerships of the EEE Department at NIT Trichy.",
        "What notable alumni have graduated from the EEE Department at NIT Trichy?",
        "How can I schedule a tour of the EEE Department at NIT Trichy?",
        "Do you have any information about student projects or innovations from the EEE Department at NIT Trichy?",
        "Tell me about the department's vision and mission at NIT Trichy.",
        "EEE?",
        "Electrical and Electronics Engineering?",
        "EEE dept",
        "Electrical dept",
        "EEE engineering"
    ],
    "responses": ["The Electrical and Electronics Engineering (EEE) Department at NIT Trichy is a distinguished center for education and research. We offer a range of programs, have a dedicated faculty, and actively engage in cutting-edge research. For the latest updates and detailed information, please visit the official EEE Department page on the NIT Trichy website."]
        },   
        {
        "tag": "Chemical Engineering Department - NIT Trichy",
        "patterns": [
        "Tell me about the Chemical Engineering Department at NIT Trichy.",
        "What programs does the Chemical Engineering Department at NIT Trichy offer?",
        "Who are the faculty members in the Chemical Engineering Department at NIT Trichy?",
        "Is there an upcoming open house or information session for the Chemical Engineering Department at NIT Trichy?",
        "I want to know more about research opportunities in the Chemical Engineering Department at NIT Trichy.",
        "What is the admission process for Chemical Engineering programs at NIT Trichy?",
        "Tell me about recent achievements or projects from the Chemical Engineering Department at NIT Trichy.",
        "How can I apply for scholarships or financial aid in the Chemical Engineering Department at NIT Trichy?",
        "Are there internship opportunities available through the Chemical Engineering Department at NIT Trichy?",
        "Is there a Chemical Engineering club or student organization at NIT Trichy?",
        "Tell me about the alumni network of the Chemical Engineering Department at NIT Trichy.",
        "Are there any upcoming events or conferences organized by the Chemical Engineering Department at NIT Trichy?",
        "Can you provide information about the facilities and labs in the Chemical Engineering Department at NIT Trichy?",
        "Tell me about the research focus areas in the Chemical Engineering Department at NIT Trichy.",
        "What is the Chemical Engineering Department's social media page or official website for updates and announcements?",
        "How can I get involved as a volunteer or mentor in the Chemical Engineering Department at NIT Trichy?",
        "Can you share contact information for inquiries related to the Chemical Engineering Department at NIT Trichy?",
        "Tell me about the Chemical Engineering Department's involvement in community outreach or education programs at NIT Trichy.",
        "What are the recent publications or research papers from the Chemical Engineering Department at NIT Trichy?",
        "Do you have information about internships and job placement rates for Chemical Engineering graduates at NIT Trichy?",
        "Tell me about the history and evolution of the Chemical Engineering Department at NIT Trichy.",
        "Are there any special events or lectures organized by the Chemical Engineering Department at NIT Trichy that I can attend?",
        "Can you provide information about the safety measures and protocols in place in the Chemical Engineering Department at NIT Trichy?",
        "Tell me about the collaborations and partnerships of the Chemical Engineering Department at NIT Trichy.",
        "What notable alumni have graduated from the Chemical Engineering Department at NIT Trichy?",
        "How can I schedule a tour of the Chemical Engineering Department at NIT Trichy?",
        "Do you have any information about student projects or innovations from the Chemical Engineering Department at NIT Trichy?",
        "Tell me about the department's vision and mission at NIT Trichy.",
        "Chemical Engineering?",
        "Chemical Engineering Department?",
        "Chemical Engg. dept",
        "Chemical dept",
        "Chemical Engineering"
    ],
    "responses": ["The Chemical Engineering Department at NIT Trichy is a distinguished center for education and research. We offer a range of programs, have a dedicated faculty, and actively engage in cutting-edge research. For the latest updates and detailed information, please visit the official Chemical Engineering Department page on the NIT Trichy website."]
        },
        {
        "tag": "Mechanical Engineering Department - NIT Trichy",
        "patterns": [
        "Tell me about the Mechanical Engineering Department at NIT Trichy.",
        "What programs does the Mechanical Engineering Department at NIT Trichy offer?",
        "Who are the faculty members in the Mechanical Engineering Department at NIT Trichy?",
        "Is there an upcoming open house or information session for the Mechanical Engineering Department at NIT Trichy?",
        "I want to know more about research opportunities in the Mechanical Engineering Department at NIT Trichy.",
        "What is the admission process for Mechanical Engineering programs at NIT Trichy?",
        "Tell me about recent achievements or projects from the Mechanical Engineering Department at NIT Trichy.",
        "How can I apply for scholarships or financial aid in the Mechanical Engineering Department at NIT Trichy?",
        "Are there internship opportunities available through the Mechanical Engineering Department at NIT Trichy?",
        "Is there a Mechanical Engineering club or student organization at NIT Trichy?",
        "Tell me about the alumni network of the Mechanical Engineering Department at NIT Trichy.",
        "Are there any upcoming events or conferences organized by the Mechanical Engineering Department at NIT Trichy?",
        "Can you provide information about the facilities and labs in the Mechanical Engineering Department at NIT Trichy?",
        "Tell me about the research focus areas in the Mechanical Engineering Department at NIT Trichy.",
        "What is the Mechanical Engineering Department's social media page or official website for updates and announcements?",
        "How can I get involved as a volunteer or mentor in the Mechanical Engineering Department at NIT Trichy?",
        "Can you share contact information for inquiries related to the Mechanical Engineering Department at NIT Trichy?",
        "Tell me about the Mechanical Engineering Department's involvement in community outreach or education programs at NIT Trichy.",
        "What are the recent publications or research papers from the Mechanical Engineering Department at NIT Trichy?",
        "Do you have information about internships and job placement rates for Mechanical Engineering graduates at NIT Trichy?",
        "Tell me about the history and evolution of the Mechanical Engineering Department at NIT Trichy.",
        "Are there any special events or lectures organized by the Mechanical Engineering Department at NIT Trichy that I can attend?",
        "Can you provide information about the safety measures and protocols in place in the Mechanical Engineering Department at NIT Trichy?",
        "Tell me about the collaborations and partnerships of the Mechanical Engineering Department at NIT Trichy.",
        "What notable alumni have graduated from the Mechanical Engineering Department at NIT Trichy?",
        "How can I schedule a tour of the Mechanical Engineering Department at NIT Trichy?",
        "Do you have any information about student projects or innovations from the Mechanical Engineering Department at NIT Trichy?",
        "Tell me about the department's vision and mission at NIT Trichy.",
        "Mechanical Engineering?",
        "Mechanical Engineering Department?",
        "Mechanical Engg. dept",
        "Mechanical dept",
        "Mechanical Engineering"
    ],
    "responses": ["The Mechanical Engineering Department at NIT Trichy is a distinguished center for education and research. We offer a range of programs, have a dedicated faculty, and actively engage in cutting-edge research. For the latest updates and detailed information, please visit the official Mechanical Engineering Department page on the NIT Trichy website."]
        },
        {
        "tag": "MME Department - NIT Trichy",
        "patterns": [
        "Tell me about the Metallurgical and Materials Engineering (MME) Department at NIT Trichy.",
        "What programs does the MME Department at NIT Trichy offer?",
        "Who are the faculty members in the Metallurgical and Materials Engineering (MME) Department at NIT Trichy?",
        "Is there an upcoming open house or information session for the MME Department at NIT Trichy?",
        "I want to know more about research opportunities in the MME Department at NIT Trichy.",
        "What is the admission process for MME programs at NIT Trichy?",
        "Tell me about recent achievements or projects from the MME Department at NIT Trichy.",
        "How can I apply for scholarships or financial aid in the MME Department at NIT Trichy?",
        "Are there internship opportunities available through the MME Department at NIT Trichy?",
        "Is there an MME club or student organization at NIT Trichy?",
        "Tell me about the alumni network of the MME Department at NIT Trichy.",
        "Are there any upcoming events or conferences organized by the MME Department at NIT Trichy?",
        "Can you provide information about the facilities and labs in the MME Department at NIT Trichy?",
        "Tell me about the research focus areas in the MME Department at NIT Trichy.",
        "What is the MME Department's social media page or official website for updates and announcements?",
        "How can I get involved as a volunteer or mentor in the MME Department at NIT Trichy?",
        "Can you share contact information for inquiries related to the MME Department at NIT Trichy?",
        "Tell me about the MME Department's involvement in community outreach or education programs at NIT Trichy.",
        "What are the recent publications or research papers from the MME Department at NIT Trichy?",
        "Do you have information about internships and job placement rates for MME graduates at NIT Trichy?",
        "Tell me about the history and evolution of the MME Department at NIT Trichy.",
        "Are there any special events or lectures organized by the MME Department at NIT Trichy that I can attend?",
        "Can you provide information about the safety measures and protocols in place in the MME Department at NIT Trichy?",
        "Tell me about the collaborations and partnerships of the MME Department at NIT Trichy.",
        "What notable alumni have graduated from the MME Department at NIT Trichy?",
        "How can I schedule a tour of the MME Department at NIT Trichy?",
        "Do you have any information about student projects or innovations from the MME Department at NIT Trichy?",
        "Tell me about the department's vision and mission at NIT Trichy.",
        "MME?",
        "Metallurgical and Materials Engineering?",
        "MME dept",
        "Metallurgical dept",
        "Materials Engineering"
    ],
    "responses": ["The Metallurgical and Materials Engineering (MME) Department at NIT Trichy is a prominent center for education and research. We offer a range of programs, have a dedicated faculty, and actively engage in cutting-edge research. For the latest updates and detailed information, please visit the official MME Department page on the NIT Trichy website."]
        },
        {
        "tag": "Civil Engineering Department - NIT Trichy",
        "patterns": [
        "Tell me about the Civil Engineering Department at NIT Trichy.",
        "What programs does the Civil Engineering Department at NIT Trichy offer?",
        "Who are the faculty members in the Civil Engineering Department at NIT Trichy?",
        "Is there an upcoming open house or information session for the Civil Engineering Department at NIT Trichy?",
        "I want to know more about research opportunities in the Civil Engineering Department at NIT Trichy.",
        "What is the admission process for Civil Engineering programs at NIT Trichy?",
        "Tell me about recent achievements or projects from the Civil Engineering Department at NIT Trichy.",
        "How can I apply for scholarships or financial aid in the Civil Engineering Department at NIT Trichy?",
        "Are there internship opportunities available through the Civil Engineering Department at NIT Trichy?",
        "Is there a Civil Engineering club or student organization at NIT Trichy?",
        "Tell me about the alumni network of the Civil Engineering Department at NIT Trichy.",
        "Are there any upcoming events or conferences organized by the Civil Engineering Department at NIT Trichy?",
        "Can you provide information about the facilities and labs in the Civil Engineering Department at NIT Trichy?",
        "Tell me about the research focus areas in the Civil Engineering Department at NIT Trichy.",
        "What is the Civil Engineering Department's social media page or official website for updates and announcements?",
        "How can I get involved as a volunteer or mentor in the Civil Engineering Department at NIT Trichy?",
        "Can you share contact information for inquiries related to the Civil Engineering Department at NIT Trichy?",
        "Tell me about the Civil Engineering Department's involvement in community outreach or education programs at NIT Trichy.",
        "What are the recent publications or research papers from the Civil Engineering Department at NIT Trichy?",
        "Do you have information about internships and job placement rates for Civil Engineering graduates at NIT Trichy?",
        "Tell me about the history and evolution of the Civil Engineering Department at NIT Trichy.",
        "Are there any special events or lectures organized by the Civil Engineering Department at NIT Trichy that I can attend?",
        "Can you provide information about the safety measures and protocols in place in the Civil Engineering Department at NIT Trichy?",
        "Tell me about the collaborations and partnerships of the Civil Engineering Department at NIT Trichy.",
        "What notable alumni have graduated from the Civil Engineering Department at NIT Trichy?",
        "How can I schedule a tour of the Civil Engineering Department at NIT Trichy?",
        "Do you have any information about student projects or innovations from the Civil Engineering Department at NIT Trichy?",
        "Tell me about the department's vision and mission at NIT Trichy.",
        "Civil Engineering?",
        "Civil Engineering Department?",
        "Civil Engg. dept",
        "Civil dept",
        "Civil Engineering"
    ],
    "responses": ["The Civil Engineering Department at NIT Trichy is a prominent center for education and research. We offer a range of programs, have a dedicated faculty, and actively engage in cutting-edge research. For the latest updates and detailed information, please visit the official Civil Engineering Department page on the NIT Trichy website."]
        },
        {
        "tag": "ICE Department - NIT Trichy",
        "patterns": [
        "Tell me about the Instrumentation and Control Engineering (ICE) Department at NIT Trichy.",
        "What programs does the ICE Department at NIT Trichy offer?",
        "Who are the faculty members in the Instrumentation and Control Engineering (ICE) Department at NIT Trichy?",
        "Is there an upcoming open house or information session for the ICE Department at NIT Trichy?",
        "I want to know more about research opportunities in the ICE Department at NIT Trichy.",
        "What is the admission process for ICE programs at NIT Trichy?",
        "Tell me about recent achievements or projects from the ICE Department at NIT Trichy.",
        "How can I apply for scholarships or financial aid in the ICE Department at NIT Trichy?",
        "Are there internship opportunities available through the ICE Department at NIT Trichy?",
        "Is there an ICE club or student organization at NIT Trichy?",
        "Tell me about the alumni network of the ICE Department at NIT Trichy.",
        "Are there any upcoming events or conferences organized by the ICE Department at NIT Trichy?",
        "Can you provide information about the facilities and labs in the ICE Department at NIT Trichy?",
        "Tell me about the research focus areas in the ICE Department at NIT Trichy.",
        "What is the ICE Department's social media page or official website for updates and announcements?",
        "How can I get involved as a volunteer or mentor in the ICE Department at NIT Trichy?",
        "Can you share contact information for inquiries related to the ICE Department at NIT Trichy?",
        "Tell me about the ICE Department's involvement in community outreach or education programs at NIT Trichy.",
        "What are the recent publications or research papers from the ICE Department at NIT Trichy?",
        "Do you have information about internships and job placement rates for ICE graduates at NIT Trichy?",
        "Tell me about the history and evolution of the ICE Department at NIT Trichy.",
        "Are there any special events or lectures organized by the ICE Department at NIT Trichy that I can attend?",
        "Can you provide information about the safety measures and protocols in place in the ICE Department at NIT Trichy?",
        "Tell me about the collaborations and partnerships of the ICE Department at NIT Trichy.",
        "What notable alumni have graduated from the ICE Department at NIT Trichy?",
        "How can I schedule a tour of the ICE Department at NIT Trichy?",
        "Do you have any information about student projects or innovations from the ICE Department at NIT Trichy?",
        "Tell me about the department's vision and mission at NIT Trichy.",
        "ICE?",
        "Instrumentation and Control Engineering?",
        "ICE dept",
        "Instrumentation dept",
        "Control Engineering"
    ],
    "responses": ["The Instrumentation and Control Engineering (ICE) Department at NIT Trichy is a distinguished center for education and research. We offer a range of programs, have a dedicated faculty, and actively engage in cutting-edge research. For the latest updates and detailed information, please visit the official ICE Department page on the NIT Trichy website."]
        },
        {
        "tag": "Production Engineering Department - NIT Trichy",
        "patterns": [
        "Tell me about the Production Engineering Department at NIT Trichy.",
        "What programs does the Production Engineering Department at NIT Trichy offer?",
        "Who are the faculty members in the Production Engineering Department at NIT Trichy?",
        "Is there an upcoming open house or information session for the Production Engineering Department at NIT Trichy?",
        "I want to know more about research opportunities in the Production Engineering Department at NIT Trichy.",
        "What is the admission process for Production Engineering programs at NIT Trichy?",
        "Tell me about recent achievements or projects from the Production Engineering Department at NIT Trichy.",
        "How can I apply for scholarships or financial aid in the Production Engineering Department at NIT Trichy?",
        "Are there internship opportunities available through the Production Engineering Department at NIT Trichy?",
        "Is there a Production Engineering club or student organization at NIT Trichy?",
        "Tell me about the alumni network of the Production Engineering Department at NIT Trichy.",
        "Are there any upcoming events or conferences organized by the Production Engineering Department at NIT Trichy?",
        "Can you provide information about the facilities and labs in the Production Engineering Department at NIT Trichy?",
        "Tell me about the research focus areas in the Production Engineering Department at NIT Trichy.",
        "What is the Production Engineering Department's social media page or official website for updates and announcements?",
        "How can I get involved as a volunteer or mentor in the Production Engineering Department at NIT Trichy?",
        "Can you share contact information for inquiries related to the Production Engineering Department at NIT Trichy?",
        "Tell me about the Production Engineering Department's involvement in community outreach or education programs at NIT Trichy.",
        "What are the recent publications or research papers from the Production Engineering Department at NIT Trichy?",
        "Do you have information about internships and job placement rates for Production Engineering graduates at NIT Trichy?",
        "Tell me about the history and evolution of the Production Engineering Department at NIT Trichy.",
        "Are there any special events or lectures organized by the Production Engineering Department at NIT Trichy that I can attend?",
        "Can you provide information about the safety measures and protocols in place in the Production Engineering Department at NIT Trichy?",
        "Tell me about the collaborations and partnerships of the Production Engineering Department at NIT Trichy.",
        "What notable alumni have graduated from the Production Engineering Department at NIT Trichy?",
        "How can I schedule a tour of the Production Engineering Department at NIT Trichy?",
        "Do you have any information about student projects or innovations from the Production Engineering Department at NIT Trichy?",
        "Tell me about the department's vision and mission at NIT Trichy.",
        "Production Engineering?",
        "Production Engineering Department?",
        "Production Engg. dept",
        "Production dept",
        "Manufacturing Engineering"
    ],
    "responses": ["The Production Engineering Department at NIT Trichy is a distinguished center for education and research. We offer a range of programs, have a dedicated faculty, and actively engage in cutting-edge research. For the latest updates and detailed information, please visit the official Production Engineering Department page on the NIT Trichy website."]
        },
        {
        "tag": "Architecture Department - NIT Trichy",
        "patterns": [
        "Tell me about the Architecture Department at NIT Trichy.",
        "What programs does the Architecture Department at NIT Trichy offer?",
        "Who are the faculty members in the Architecture Department at NIT Trichy?",
        "Is there an upcoming open house or information session for the Architecture Department at NIT Trichy?",
        "I want to know more about research opportunities in the Architecture Department at NIT Trichy.",
        "What is the admission process for Architecture programs at NIT Trichy?",
        "Tell me about recent achievements or projects from the Architecture Department at NIT Trichy.",
        "How can I apply for scholarships or financial aid in the Architecture Department at NIT Trichy?",
        "Are there internship opportunities available through the Architecture Department at NIT Trichy?",
        "Is there an Architecture club or student organization at NIT Trichy?",
        "Tell me about the alumni network of the Architecture Department at NIT Trichy.",
        "Are there any upcoming events or conferences organized by the Architecture Department at NIT Trichy?",
        "Can you provide information about the facilities and studios in the Architecture Department at NIT Trichy?",
        "Tell me about the research focus areas in the Architecture Department at NIT Trichy.",
        "What is the Architecture Department's social media page or official website for updates and announcements?",
        "How can I get involved as a volunteer or mentor in the Architecture Department at NIT Trichy?",
        "Can you share contact information for inquiries related to the Architecture Department at NIT Trichy?",
        "Tell me about the Architecture Department's involvement in community outreach or architectural initiatives at NIT Trichy.",
        "What are the recent publications or design projects from the Architecture Department at NIT Trichy?",
        "Do you have information about internships and job placement rates for Architecture graduates at NIT Trichy?",
        "Tell me about the history and evolution of the Architecture Department at NIT Trichy.",
        "Are there any special events or design exhibitions organized by the Architecture Department at NIT Trichy that I can attend?",
        "Can you provide information about the safety measures and design studio protocols in place in the Architecture Department at NIT Trichy?",
        "Tell me about the collaborations and partnerships of the Architecture Department at NIT Trichy.",
        "What notable alumni have graduated from the Architecture Department at NIT Trichy?",
        "How can I schedule a tour of the Architecture Department at NIT Trichy?",
        "Do you have any information about student architectural projects or innovative designs from the Architecture Department at NIT Trichy?",
        "Tell me about the department's vision and mission at NIT Trichy.",
        "Architecture?",
        "Architecture Department?",
        "Architectural Engg. dept",
        "Archi dept",
        "Architectural Engineering"
    ],
    "responses": ["The Architecture Department at NIT Trichy is a distinguished center for architectural education and research. We offer various programs, have a dedicated faculty, and actively engage in innovative design projects. For the latest updates and detailed information, please visit the official Architecture Department page on the NIT Trichy website."]
        },
         {
            "tag": "fallback",
            "patterns": [
                "What's your favorite book?",
                "Tell me about your preferred book.",
                "Do you have a favorite novel?"
            ],
            "responses": ["I'm here to help you with information about NIT Trichy. If you have any questions about academics, cultural events, or campus facilities, feel free to ask!"]
        }
    ]
}
